; domain
(define (domain grid)
(:requirements :strips)
(:predicates (conn ?x ?y)
             (key-shape ?k ?s)
             (lock-shape ?x ?s)
             (at ?r ?x )
	     (at-robot ?x)
             (place ?p)
             (key ?k)
             (shape ?s)
             (locked ?x)
             (holding ?k)
             (open ?x)
             (arm-empty ))



(:action unlock
:parameters (?curpos ?lockpos ?key ?shape)
:precondition (and (place ?curpos) (place ?lockpos) (key ?key) (shape ?shape)
          (conn ?curpos ?lockpos) (key-shape ?key ?shape)
                   (lock-shape ?lockpos ?shape) (at-robot ?curpos)
                   (locked ?lockpos) (holding ?key))
:effect (and  (open ?lockpos) (not (locked ?lockpos))))


(:action move
:parameters (?curpos ?nextpos)
:precondition (and (place ?curpos) (place ?nextpos)
               (at-robot ?curpos) (conn ?curpos ?nextpos) (open ?nextpos))
:effect (and (at-robot ?nextpos) (not (at-robot ?curpos))))

(:action pickup
:parameters (?curpos ?key)
:precondition (and (place ?curpos) (key ?key)
                  (at-robot ?curpos) (at ?key ?curpos) (arm-empty ))
:effect (and (holding ?key)
   (not (at ?key ?curpos)) (not (arm-empty ))))


(:action pickup-and-loose
:parameters (?curpos ?newkey ?oldkey)
:precondition (and (place ?curpos) (key ?newkey) (key ?oldkey)
                  (at-robot ?curpos) (holding ?oldkey) (at ?newkey ?curpos))
:effect (and (holding ?newkey) (at ?oldkey ?curpos)
        (not (holding ?oldkey)) (not (at ?newkey ?curpos))))

(:action putdown
:parameters (?curpos ?key)
:precondition (and (place ?curpos) (key ?key)
                  (at-robot ?curpos) (holding ?key))
:effect (and (arm-empty ) (at ?key ?curpos) (not (holding ?key)))))

; problem
(define (problem grid-x2-y3-t2-k33-l22-p50)
(:domain grid)
(:objects 
        f0-0f f1-0f 
        f0-1f f1-1f 
        f0-2f f1-2f 
        shape0 shape1 
        key0-0 key0-1 key0-2 
        key1-0 key1-1 key1-2 
)
(:init
(arm-empty)
(place f0-0f)
(place f1-0f)
(place f0-1f)
(place f1-1f)
(place f0-2f)
(place f1-2f)
(shape shape0)
(shape shape1)
(key key0-0)
(key-shape key0-0 shape0)
(key key0-1)
(key-shape key0-1 shape0)
(key key0-2)
(key-shape key0-2 shape0)
(key key1-0)
(key-shape key1-0 shape1)
(key key1-1)
(key-shape key1-1 shape1)
(key key1-2)
(key-shape key1-2 shape1)
(conn f0-0f f1-0f)
(conn f0-1f f1-1f)
(conn f0-2f f1-2f)
(conn f0-0f f0-1f)
(conn f1-0f f1-1f)
(conn f0-1f f0-2f)
(conn f1-1f f1-2f)
(conn f1-0f f0-0f)
(conn f1-1f f0-1f)
(conn f1-2f f0-2f)
(conn f0-1f f0-0f)
(conn f1-1f f1-0f)
(conn f0-2f f0-1f)
(conn f1-2f f1-1f)
(open f1-1f)
(open f1-2f)
(locked f0-1f)
(lock-shape f0-1f shape0)
(locked f0-2f)
(lock-shape f0-2f shape0)
(locked f1-0f)
(lock-shape f1-0f shape1)
(locked f0-0f)
(lock-shape f0-0f shape1)
(at key0-0 f1-0f)
(at key0-1 f0-0f)
(at key0-2 f1-2f)
(at key1-0 f1-0f)
(at key1-1 f0-0f)
(at key1-2 f1-2f)
(at-robot f1-2f)
)
(:goal
(and
(at key0-0 f0-2f)
(at key0-1 f1-1f)
(at key0-2 f0-0f)
(at key1-1 f0-1f)
(at key1-2 f1-0f)
)
)
)

; plan
1. (pickup f1-2f key0-2)
   deleted: (at key0-2 f1-2f) (arm-empty)
   added: (holding key0-2)
   goals met: 0 of 5
2. (unlock f1-2f f0-2f key0-2 shape0)
   deleted: (locked f0-2f)
   added: (open f0-2f)
   goals met: 0 of 5
3. (move f1-2f f1-1f)
   deleted: (at-robot f1-2f)
   added: (at-robot f1-1f)
   goals met: 0 of 5
4. (unlock f1-1f f0-1f key0-2 shape0)
   deleted: (locked f0-1f)
   added: (open f0-1f)
   goals met: 0 of 5
5. (move f1-1f f1-2f)
   deleted: (at-robot f1-1f)
   added: (at-robot f1-2f)
   goals met: 0 of 5
6. (pickup-and-loose f1-2f key1-2 key0-2)
   deleted: (holding key0-2) (at key1-2 f1-2f)
   added: (holding key1-2) (at key0-2 f1-2f)
   goals met: 0 of 5
7. (move f1-2f f1-1f)
   deleted: (at-robot f1-2f)
   added: (at-robot f1-1f)
   goals met: 0 of 5
8. (unlock f1-1f f1-0f key1-2 shape1)
   deleted: (locked f1-0f)
   added: (open f1-0f)
   goals met: 0 of 5
9. (move f1-1f f1-0f)
   deleted: (at-robot f1-1f)
   added: (at-robot f1-0f)
   goals met: 0 of 5
10. (unlock f1-0f f0-0f key1-2 shape1)
   deleted: (locked f0-0f)
   added: (open f0-0f)
   goals met: 0 of 5
11. (pickup-and-loose f1-0f key0-0 key1-2)
   deleted: (holding key1-2) (at key0-0 f1-0f)
   added: (holding key0-0) (at key1-2 f1-0f)
   goals met: 1 of 5
12. (move f1-0f f1-1f)
   deleted: (at-robot f1-0f)
   added: (at-robot f1-1f)
   goals met: 1 of 5
13. (move f1-1f f0-1f)
   deleted: (at-robot f1-1f)
   added: (at-robot f0-1f)
   goals met: 1 of 5
14. (move f0-1f f0-2f)
   deleted: (at-robot f0-1f)
   added: (at-robot f0-2f)
   goals met: 1 of 5
15. (putdown f0-2f key0-0)
   deleted: (holding key0-0)
   added: (arm-empty) (at key0-0 f0-2f)
   goals met: 2 of 5
16. (move f0-2f f1-2f)
   deleted: (at-robot f0-2f)
   added: (at-robot f1-2f)
   goals met: 2 of 5
17. (pickup f1-2f key0-2)
   deleted: (at key0-2 f1-2f) (arm-empty)
   added: (holding key0-2)
   goals met: 2 of 5
18. (move f1-2f f1-1f)
   deleted: (at-robot f1-2f)
   added: (at-robot f1-1f)
   goals met: 2 of 5
19. (move f1-1f f0-1f)
   deleted: (at-robot f1-1f)
   added: (at-robot f0-1f)
   goals met: 2 of 5
20. (move f0-1f f0-0f)
   deleted: (at-robot f0-1f)
   added: (at-robot f0-0f)
   goals met: 2 of 5
21. (pickup-and-loose f0-0f key0-1 key0-2)
   deleted: (holding key0-2) (at key0-1 f0-0f)
   added: (holding key0-1) (at key0-2 f0-0f)
   goals met: 3 of 5
22. (move f0-0f f0-1f)
   deleted: (at-robot f0-0f)
   added: (at-robot f0-1f)
   goals met: 3 of 5
23. (move f0-1f f1-1f)
   deleted: (at-robot f0-1f)
   added: (at-robot f1-1f)
   goals met: 3 of 5
24. (putdown f1-1f key0-1)
   deleted: (holding key0-1)
   added: (arm-empty) (at key0-1 f1-1f)
   goals met: 4 of 5
25. (move f1-1f f0-1f)
   deleted: (at-robot f1-1f)
   added: (at-robot f0-1f)
   goals met: 4 of 5
26. (move f0-1f f0-0f)
   deleted: (at-robot f0-1f)
   added: (at-robot f0-0f)
   goals met: 4 of 5
27. (pickup f0-0f key1-1)
   deleted: (at key1-1 f0-0f) (arm-empty)
   added: (holding key1-1)
   goals met: 4 of 5
28. (move f0-0f f0-1f)
   deleted: (at-robot f0-0f)
   added: (at-robot f0-1f)
   goals met: 4 of 5
29. (putdown f0-1f key1-1)
   deleted: (holding key1-1)
   added: (arm-empty) (at key1-1 f0-1f)
   goals met: 5 of 5
